app/views/users/show.html.erb

        <%= render 'follow_form' if logged_in? %>
        <% if @user.microposts.any?%>
            <h4 class="mt-3">Microposts (<%=@user.microposts.count%>)</h3>
---
SELECT  1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 2 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2