app/views/shared/_user_info.html.erb

    <span>
        <%= pluralize(@user.microposts.count, "micropost") %>
---
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2