app/controllers/static_pages_controller.rb

  def home
    #1 . check if user is logged in
    if logged_in?
      # 2. create micropost if there is current_user
      @micropost = current_user.microposts.build

      # feed_items -> shows you microposts in Home page
      @feed_items = current_user.feed.paginate(page: params[:page], per_page: 12)
---
SELECT  `microposts`.* FROM `microposts` WHERE (user_id = 2) ORDER BY created_at DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2