app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    # @users = User.all
    #variable = Model.paginate[page: params[current_page]]
    # @users = User.paginate(page: params[:page], per page: 10)
    @users = User.paginate(page: params[:page], per_page: 10 )

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 2 ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2
---
  def show
    @user = User.find(params[:id])

    #show all microposts of this user
    @microposts = @user.microposts.paginate(page: params[:page], per_page: 10)