app/models/user.rb

    def follow(other_user)
        active_relationships.create!(followed_id: other_user.id)
---
INSERT INTO `relationships` (`follower_id`, `followed_id`, `created_at`, `updated_at`) VALUES (1, 3, '2020-10-05 03:38:00', '2020-10-05 03:38:00')